# <center>Pandas Python Library for Beginners in Data Science
#### <center>Instructor: Vinita Silaparasetty

### Import Libraries

In [1]:
import numpy as np
import pandas as pd

# <center> Creating a Series

<img src="https://github.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/blob/master/Media/series.png?raw=true" width="600" height="600">

### <center> Method 1: Using an Array

In [2]:
s = ([1,np.nan,'Pandas Library'])
s1 = pd.Series(s)
s1

0                 1
1               NaN
2    Pandas Library
dtype: object

## <center>üèÜ Challenge

Create a Pandas Series, named s2, containing the following:

* Integer = 2

* Nan value

* Character = b

In [3]:
s = ([2,np.nan,'b'])
s2 = pd.Series(s)
s2

0      2
1    NaN
2      b
dtype: object

### <center> Method 2: Using a List

In [5]:
list1 = ['animal','2','animal']
s3 = pd.Series(list1)
s3

0    animal
1         2
2    animal
dtype: object

## <center>üèÜ Challenge

Create a Pandas Series, named s4.
Use a list, named list2, containing the following:

* Integer = 3

* Character = c

* String = Numpy 

Note:'N' Must be capital

In [6]:
list2 = ['3','c','Numpy']
s4 = pd.Series(list2)
s4

0        3
1        c
2    Numpy
dtype: object

### <center> Method 3: Using a Dictionary

In [7]:
s5 = pd.Series(
    {'A':1, 
    '3':'Python',
    })
s5

A         1
3    Python
dtype: object

## <center>üèÜ Challenge

Create a Pandas Series, named s6, containing the following:

* 'Integer' = 3
* 'B' = Boys

In [8]:
s6 = pd.Series(
    {'Integer':3,
    'B': 'Boys'})
s6

Integer       3
B          Boys
dtype: object

# <center> Creating Data Frames

<img src="https://github.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/blob/master/Media/dataframe.gif?raw=true" width="600" height="600">

### <center> Method 1: Passing a Numpy Array

In [10]:
df = pd.DataFrame(np.random.randn(6,4))
df

          0         1         2         3
0  1.443545  0.929802  0.560328  1.962432
1  2.331868  0.169183 -1.364112 -0.886744
2  0.031308  1.602513 -0.395051 -0.055154
3 -0.989901  0.878694 -0.033495 -1.262834
4 -0.773070  1.481504 -0.389089 -0.294611
5 -0.513858 -0.183669 -0.849167  0.300372

## <center>üèÜ Challenge

Create a data frame, named df1, which contains:

* A randomly generated array with the dimensions 3x3.

In [11]:
df1 = pd.DataFrame(np.random.randn(3,3))
df1

          0         1         2
0  1.637740  0.913122  0.466620
1 -2.153077 -0.572233 -2.006038
2  1.100946 -0.078194 -0.255825

### <center> Method 2: Passing a Dictionary of Objects

In [12]:
df2 = pd.DataFrame({
    'A':1,
    'number':np.array([6]*3,dtype='int32'),
})
df2

   A  number
0  1       6
1  1       6
2  1       6

## <center>üèÜ Challenge

Create a data frame, named df3, which contains:

* 'E' = np.array([4] * 5,dtype='int32')

* 'Day' = 2

In [14]:
df3 = pd.DataFrame({
    'E' : np.array([4] * 5,dtype='int32'),
    'Day' : 2
})
df3

   E  Day
0  4    2
1  4    2
2  4    2
3  4    2
4  4    2

--------

## <center> Importing Files

### Import .csv files

Use the file path: /home/rhyme/Desktop/Project/

(Note: If you want to use this command for a file on your own system, be sure to use the correct file path.)

In [16]:
df4 = pd.read_csv('/home/rhyme/Desktop/Project/practicedata.csv')
df4.head(3)

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132

-----------------

## <center>üèÜ Challenge
    
Import the file practicedata.json in the dataframe df5.

Use the file path: /home/rhyme/Desktop/Project/

In [17]:
df5 = pd.read_json('/home/rhyme/Desktop/Project/practicedata.json')
df5.head(3)

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132

### Importing Files from a url

Import data from this github repo: https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.csv")

In [18]:
df6 = pd.read_csv("https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.csv")
df6.head(3)

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132

## <center>üèÜ Challenge
    
Create the data frame df7.

Then import data from this github repo: https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.json

In [19]:
df = pd.read_json("https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.json")
df.head(3)

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132

## <center> Export Files

### Export .csv Files

In [20]:
df4.to_csv('/home/rhyme/Desktop/Project/practicedata2.csv')

## <center>üèÜ Challenge

Export the data from df4 to 'practicedata2.json'

Use the file path:/home/rhyme/Desktop/Project/

In [21]:
df4.to_json('/home/rhyme/Desktop/Project/practicedata2.json')

## <center>Data Summary
    
We will be working with data frame df6 for this section.

In [22]:
#first run this cell to create the data frame df6
df6 = pd.read_csv("https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.csv")
df6

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
5 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912
7 -0.488965  0.946528  0.829525 -0.529912

### Quick Summary of Data

In [23]:
df6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       7 non-null      float64
 1   B       8 non-null      float64
 2   C       8 non-null      float64
 3   D       7 non-null      float64
dtypes: float64(4)
memory usage: 384.0 bytes

### Detailed Summary of Data

In [24]:
df6.describe()

              A         B         C         D
count  7.000000  8.000000  8.000000  7.000000
mean  -0.412650  0.331360  0.619777 -0.021321
std    0.533101  1.010369  0.987050  1.192849
min   -1.013616 -1.604969 -1.174912 -1.632132
25%   -0.751291 -0.224553  0.095289 -0.766418
50%   -0.488965  0.549208  0.829525 -0.529912
75%   -0.161808  0.946528  1.079757  1.041241
max    0.440231  1.713480  1.786915  1.463154

## <center>View Columns

In [25]:
df6.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

## <center>üèÜ Challenge
    
View the columns in df7.

In [28]:
#first run this cell to create the data frame df7
df7 = pd.read_json("https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.json")
df7

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
5 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912
7 -0.488965  0.946528  0.829525 -0.529912

In [29]:
df7.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

## <center>View Datatypes

In [30]:
df6.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

## <center>üèÜ Challenge
    
View the datatypes in df7

In [31]:
df7.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

## <center>Handling Duplicates

### Detect Duplicate Rows

In [32]:
df6.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7     True
dtype: bool

### Drop Duplicate Rows

In [33]:
df6.drop_duplicates()

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912

## <center>üèÜ Challenge
    
Detect and drop duplicates in df7

In [34]:
#Detect duplicates
df7.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7     True
dtype: bool

In [35]:
#Drop duplicates
df7.drop_duplicates()

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912

## <center>Handling Missing Values

### Detect Missing Values

In [36]:
print(df6.isnull().sum())

A    1
B    0
C    0
D    1
dtype: int64

### Drop Missing Values

In [37]:
df6.dropna()

          A         B         C         D
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
5 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912
7 -0.488965  0.946528  0.829525 -0.529912

## <center>üèÜ Challenge
    
Detect and drop missing values in df7

In [38]:
#Detect missing values
print(df7.isnull().sum())

A    1
B    0
C    0
D    1
dtype: int64

In [39]:
#Drop missing values
df7.dropna()

          A         B         C         D
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
5 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912
7 -0.488965  0.946528  0.829525 -0.529912

## <center>Numeric Operations

We will work with the data frame df8.

In [40]:
#first run this cell to create the dataframe df8
df8 = pd.DataFrame(np.random.randn(6,4))
df8

          0         1         2         3
0 -1.567624 -0.692567 -0.788545 -0.455801
1 -0.463180  0.230565 -0.892793 -0.146693
2  0.761239 -0.778758  0.714354 -1.682301
3  1.177391  1.093018 -0.411430 -0.652305
4  0.749949  1.650218 -1.585204  1.310547
5  0.139313  1.935366  0.344839  0.343828

### Calculate the Mean:

In [41]:
df8.mean()

0    0.132848
1    0.572974
2   -0.436463
3   -0.213787
dtype: float64

## <center>üèÜ Challenge
    
Calculate the mean of df9

In [42]:
#first run this cell to create df9
df9 = pd.DataFrame(np.random.randn(3,4))
df9

          0         1         2         3
0 -0.533771 -1.952474  1.636718  0.006334
1 -0.414970 -1.193878  1.324878 -0.692531
2  1.444425  2.107838 -2.280628 -0.206335

In [43]:
df9.mean()

0    0.165228
1   -0.346171
2    0.226989
3   -0.297510
dtype: float64

### Calculate the Cumulative Sum:

In [44]:
df8.apply(np.cumsum)

          0         1         2         3
0 -1.567624 -0.692567 -0.788545 -0.455801
1 -2.030804 -0.462002 -1.681338 -0.602494
2 -1.269565 -1.240760 -0.966984 -2.284794
3 -0.092174 -0.147742 -1.378414 -2.937100
4  0.657775  1.502476 -2.963618 -1.626553
5  0.797088  3.437842 -2.618779 -1.282725

## <center>üèÜ Challenge
    
Calculate the cumulative sum of df9

In [45]:
df9.apply(np.cumsum)

          0         1         2         3
0 -0.533771 -1.952474  1.636718  0.006334
1 -0.948741 -3.146351  2.961596 -0.686197
2  0.495684 -1.038514  0.680968 -0.892531

### Find the Maximum Value:

In [46]:
df8.max()

0    1.177391
1    1.935366
2    0.714354
3    1.310547
dtype: float64

## <center>üèÜ Challenge

Find the maximum value of df9

In [47]:
df9.max()

0    1.444425
1    2.107838
2    1.636718
3    0.006334
dtype: float64

### Find the Minimum Value:

In [48]:
df8.min()

0   -1.567624
1   -0.778758
2   -1.585204
3   -1.682301
dtype: float64

## <center>üèÜ Challenge

Find the minimum value of df9

In [49]:
df9.min()

0   -0.533771
1   -1.952474
2   -2.280628
3   -0.692531
dtype: float64

## <center>String Manipulation

We will work with the series s7 for this section.

In [50]:
#first run this cell to create series s7
s7 = np.array(['animal','bird',' Pandas Library  '] )
s7= pd.Series(s7)
s7

0               animal
1                 bird
2     Pandas Library
dtype: object

### Convert to Lower Case

In [51]:
s7.str.lower()

0               animal
1                 bird
2     pandas library
dtype: object

## <center>üèÜ Challenge

Convert the strings in s8 to lower case.

In [53]:
s8 = np.array(['cat','dog','Python Programming'])
s8 = pd.Series(s8)
s8

0                   cat
1                   dog
2    Python Programming
dtype: object

In [54]:
s8.str.lower()

0                   cat
1                   dog
2    python programming
dtype: object

---------------

### Convert to Upper Case

In [55]:
s7.str.upper()

0               ANIMAL
1                 BIRD
2     PANDAS LIBRARY
dtype: object

## <center>üèÜ Challenge

Convert the strings in s8 to upper case.

In [56]:
s8.str.upper()

0                   CAT
1                   DOG
2    PYTHON PROGRAMMING
dtype: object

### Swap Capitalization

In [57]:
s7.str.swapcase()

0               ANIMAL
1                 BIRD
2     pANDAS lIBRARY
dtype: object

## <center>üèÜ Challenge

Swap the capitalization of the strings in s8.

In [58]:
s8.str.swapcase()

0                   CAT
1                   DOG
2    pYTHON pROGRAMMING
dtype: object

### Find Length of String

In [59]:
s7.str.len()

0     6
1     4
2    17
dtype: int64

## <center>üèÜ Challenge

Find the length of the strings in s8.

In [60]:
s8.str.len()

0     3
1     3
2    18
dtype: int64

-------------

### Split String

In [61]:
s7.str.split()

0             [animal]
1               [bird]
2    [Pandas, Library]
dtype: object

## <center>üèÜ Challenge

Find the length of the strings in s8.

In [62]:
#first run this cell to create the series s8
s8 = np.array(['cat','dog',' Python Programming  '] )
s8= pd.Series(s8)
s8

0                      cat
1                      dog
2     Python Programming
dtype: object

In [63]:
s8.str.split()

0                    [cat]
1                    [dog]
2    [Python, Programming]
dtype: object

### Detect Unique Values

In [64]:
s7.unique()

array(['animal', 'bird', ' Pandas Library  '], dtype=object)

## <center>üèÜ Challenge

Detect unique values in s8.

In [65]:
s8.unique()

array(['cat', 'dog', ' Python Programming  '], dtype=object)

### Repeat String

We will work with the series s7 for this section.

In [66]:
#first run this cell to create series s7
s7 = np.array(['animal','bird',' Pandas Library  '] )
s7= pd.Series(s7)
s7

0               animal
1                 bird
2     Pandas Library
dtype: object

In [67]:
repeat_list = [2,3,2]
s7.str.repeat(repeat_list)

0                          animalanimal
1                          birdbirdbird
2     Pandas Library   Pandas Library
dtype: object

## <center>üèÜ Challenge

Repeat the values in s8 in the order [1,2,3]

In [ ]:
## <center>üèÜ Challenge

Repeat the values in s8 in the order [1,2,3]

In [68]:
repeat_list = [1,2,3]
s8.str.repeat(repeat_list)

0                                                  cat
1                                               dogdog
2     Python Programming   Python Programming   Pyt...
dtype: object